docs/coding_interview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coding Interview Preparation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Coding Interview Preparation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc220f4f">1. Data Structures Review</a>
<ul>
<li><a href="#org7ad97d5">1.1. <span class="todo TODO">TODO</span> How Primitive Types are represented in</a></li>
<li><a href="#orge7943df">1.2. Primitive Types</a>
<ul>
<li>
<ul>
<li><a href="#org97339fa">1.2.0.1. Bit Manipulation</a></li>
<li><a href="#orgd55490f">1.2.0.2. Swapping Bits</a></li>
<li><a href="#org9d736f8">1.2.0.3. Cheatsheet</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1d3e0c2">1.3. Arrays</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc220f4f" class="outline-2">
<h2 id="orgc220f4f"><span class="section-number-2">1</span> Data Structures Review</h2>
<div class="outline-text-2" id="text-1">
<p>
Integers in Python
</p>
</div>
<div id="outline-container-org7ad97d5" class="outline-3">
<h3 id="org7ad97d5"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> How Primitive Types are represented in</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Python</li>
<li>C++</li>
</ol>
</div>
</div>

<div id="outline-container-orge7943df" class="outline-3">
<h3 id="orge7943df"><span class="section-number-3">1.2</span> Primitive Types</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Integers in Python 3 are unbounded &#x2013; the maximum integer
representable is a function of available memory. The constant
<code>sys.maxsize</code> can be used to find the word-size. Bounds on floats are
specified in <code>sys.float_info</code>.
</p>
</div>

<div id="outline-container-org97339fa" class="outline-5">
<h5 id="org97339fa"><span class="section-number-5">1.2.0.1</span> Bit Manipulation</h5>
<div class="outline-text-5" id="text-1-2-0-1">
<p>
Computing the parity of a word.
</p>
<div class="org-src-container">
<pre class="src src-python">def parity(x):
    result = 0
    while x:
        result ^= x &amp; 1
        x &gt;&gt;= 1
    return result
</pre>
</div>

<p>
<code>x &amp;</code> x - 1= Drops the lowest set bit of x. 
</p>

<p>
The parity of 11011111 is the same as the parity of 1101 XORed with 1111.
</p>
<div class="org-src-container">
<pre class="src src-python">def parity(x):
    x ^= x &gt;&gt; 32
    x ^= x &gt;&gt; 16
    x ^= x &gt;&gt; 8
    x ^= x &gt;&gt; 4
    x ^= x &gt;&gt; 2
    x ^= x &gt;&gt; 1
    return x &amp; 0x1
</pre>
</div>

<p>
With time complexity of \(O(\log n)\).
</p>
</div>
</div>

<div id="outline-container-orgd55490f" class="outline-5">
<h5 id="orgd55490f"><span class="section-number-5">1.2.0.2</span> Swapping Bits</h5>
<div class="outline-text-5" id="text-1-2-0-2">
<div class="org-src-container">
<pre class="src src-python">def swap_bits(x, i, j):
    if (x &gt;&gt; i) &amp; 1 != (x &gt;&gt; j) &amp; 1: # if ith and jth bits differ
        bit_mask = (1 &lt;&lt; i) | (1 &lt;&lt; j)
        x ^= bit_mask
    return x

</pre>
</div>
</div>
</div>
<div id="outline-container-org9d736f8" class="outline-5">
<h5 id="org9d736f8"><span class="section-number-5">1.2.0.3</span> Cheatsheet</h5>
<div class="outline-text-5" id="text-1-2-0-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">expression</th>
<th scope="col" class="org-left">output</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x &amp; x - 1</td>
<td class="org-left">clears the lowest set bit of x</td>
</tr>

<tr>
<td class="org-left">x &amp; ~(x-1)</td>
<td class="org-left">extracts the lowest set bit of x</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org1d3e0c2" class="outline-3">
<h3 id="org1d3e0c2"><span class="section-number-3">1.3</span> Arrays</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Arrays are contiguous blocks of memory, usually used to represent
sequences.
</p>

<p>
Insertion into a full array can be handled by resizing, allocating a
new array with additional memory and copying over the entries from the
original array.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 11:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
